Repository: czhovo/chekinana
Catalog: ios/Chekinana/Chekinana/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

# product.scan.phase.direct_processing
source: Normalizing the full Cheki
ja: チェキ全体を正規化中
zh_hans: 正在规范化整张拍立得
zh_hant: 正在正規化整張拍立得

# product.scan.phase.extracting
source: Extracting each Cheki
ja: チェキを1枚ずつ切り出し中
zh_hans: 正在逐张提取拍立得
zh_hant: 正在逐張擷取拍立得

# product.scan.phase.loading
source: Backend is reading the source image
ja: バックエンドが元画像を読み込み中
zh_hans: 后端读取源图
zh_hant: 後端正在讀取原圖

# product.scan.phase.processing
source: Backend processing
ja: バックエンドで処理中
zh_hans: 后端处理中
zh_hant: 後端處理中

# product.scan.phase.processing_direct
source: Processing the full Cheki
ja: チェキ全体を処理中
zh_hans: 正在处理整张拍立得
zh_hant: 正在處理整張拍立得

# product.scan.phase.retrieving
source: Retrieving results
ja: 結果を取得中
zh_hans: 正在获取结果
zh_hant: 正在取得結果

# product.scan.phase.retrieving_with_date
source: Retrieving results and recognizing dates
ja: 結果を取得して日付を認識中
zh_hans: 正在获取结果并识别日期
zh_hant: 正在取得結果並辨識日期

# product.scan.phase.runtime_failed
source: Backend failed to start
ja: バックエンドの起動に失敗しました
zh_hans: 后端启动失败
zh_hant: 後端啟動失敗

# product.scan.phase.runtime_offline
source: Starting backend
ja: バックエンドを起動中
zh_hans: 正在启动后端
zh_hant: 正在啟動後端

# product.scan.phase.runtime_ready
source: Backend ready
ja: バックエンドの準備完了
zh_hans: 后端已就绪
zh_hant: 後端已就緒

# product.scan.phase.runtime_starting
source: Backend is starting
ja: バックエンドを起動しています
zh_hans: 后端正在启动
zh_hant: 後端正在啟動

# product.scan.phase.waiting
source: Waiting in backend queue
ja: バックエンドのキューで待機中
zh_hans: 等待后端队列
zh_hant: 正在後端佇列中等待

# product.scan.photos
source: Photos
ja: 写真
zh_hans: 照片
zh_hant: 照片

# product.scan.photos.subtitle
source: Choose from library
ja: ライブラリから選択
zh_hans: 从照片图库选择
zh_hant: 從照片圖庫選擇

# product.scan.progress.date_recognition
source: Date recognition
ja: 日付認識
zh_hans: 日期识别
zh_hant: 日期辨識

# product.scan.progress.downloaded
source: Downloaded %lld
ja: 取得済み%lld枚
zh_hans: 已获取%lld张
zh_hant: 已取得 %lld 張

# product.scan.progress.generating_preview
source: Generating preview
ja: プレビューを生成中
zh_hans: 正在生成预览
zh_hant: 正在產生預覽

# product.scan.progress.idol_recognition
source: Idol recognition
ja: アイドル認識
zh_hans: 偶像识别
zh_hant: 偶像識別

# product.scan.progress.image
source: Image processing
ja: 画像処理
zh_hans: 图像处理
zh_hant: 影像處理

# product.scan.progress.preparing_cheki
source: Preparing extracted Cheki %1$lld/%2$lld
ja: 切り出したチェキを準備中%1$lld/%2$lld
zh_hans: 正在准备提取的拍立得%1$lld/%2$lld
zh_hant: 正在準備擷取的拍立得%1$lld/%2$lld

# product.scan.progress.preparing_direct
source: Preparing Cheki %1$lld/%2$lld
ja: チェキを準備中%1$lld/%2$lld
zh_hans: 正在准备拍立得%1$lld/%2$lld
zh_hant: 正在準備拍立得%1$lld/%2$lld

# product.scan.progress.published
source: Published %lld
ja: 公開済み%lld枚
zh_hans: 本图已发布%lld张
zh_hant: 本圖已發佈%lld張

# product.scan.progress.published_expected
source: Published %1$lld/%2$lld
ja: 公開済み%1$lld/%2$lld枚
zh_hans: 本图已发布%1$lld/%2$lld张
zh_hant: 本圖已發佈%1$lld/%2$lld張

# product.scan.progress.recognition
source: Recognition
ja: 認識
zh_hans: 识别
zh_hant: 識別

# product.scan.progress.recognizing_idol
source: Recognizing Idols on device %1$lld/%2$lld
ja: 端末内でアイドルを認識中%1$lld/%2$lld
zh_hans: 正在本机识别偶像%1$lld/%2$lld
zh_hant: 正在本機識別偶像 %1$lld/%2$lld

# product.scan.progress.source
source: Source %1$lld/%2$lld
ja: 元画像%1$lld/%2$lld
zh_hans: 原图%1$lld/%2$lld
zh_hant: 原圖%1$lld/%2$lld

# product.scan.progress.totals
source: Total acquired %1$lld · prepared %2$lld
ja: 累計取得%1$lld枚・準備済み%2$lld枚
zh_hans: 累计已获得%1$lld张 · 已准备%2$lld张
zh_hant: 累計已取得%1$lld張 · 已準備%2$lld張

# product.scan.recognize_date
source: Recognize date
ja: 日付を認識
zh_hans: 识别日期
zh_hant: 識別日期

# product.scan.recognize_idol
source: Recognize Idols
ja: アイドルを認識
zh_hans: 识别偶像
zh_hant: 識別偶像

# product.scan.resume_review
source: Resume review of %lld temporary Cheki
ja: 一時チェキ%lld枚の確認を再開
zh_hans: 继续检查%lld张临时切
zh_hant: 繼續檢查 %lld 張暫存拍立得

# product.scan.review.alert_title
source: Scan review
ja: スキャン確認
zh_hans: 扫描检查
zh_hant: 掃描檢查

# product.scan.review.annotation_failed
source: Unable to prepare the detection box.
ja: 検出枠を準備できませんでした。
zh_hans: 无法生成标注框。
zh_hant: 無法產生標註框。

# product.scan.review.batch_unverified
source: Batch save did not return a complete verifiable result. Temporary Cheki were kept.
ja: 一括保存から検証可能な完全な結果が返りませんでした。一時チェキは保持されています。
zh_hans: 批量保存未返回可验证的完整结果；临时拍立得已保留。
zh_hant: 批次儲存未傳回可驗證的完整結果；暫存拍立得已保留。

# product.scan.review.capture_locked
source: Some results from this camera source are being confirmed for saving. Nothing was deleted.
ja: このカメラ写真の一部は保存確認中です。何も削除されませんでした。
zh_hans: 该相机源仍有结果处于保存确认中，未删除任何内容。
zh_hant: 該相機來源仍有結果正在確認儲存，未刪除任何內容。

# product.scan.review.confirmation_incomplete
source: Save confirmation information is incomplete. Temporary Cheki were unlocked; edit them and try again.
ja: 保存確認情報が不完全です。一時チェキのロックを解除したので、編集して再試行できます。
zh_hans: 保存确认信息不完整；临时拍立得已解除锁定，可以修改后重试。
zh_hant: 儲存確認資訊不完整；暫存拍立得已解除鎖定，可以修改後重試。

# product.scan.review.date_not_recognized
source: Date not recognized
ja: 日付未認識
zh_hans: 日期未识别
zh_hant: 日期未識別

# product.scan.review.date_picker.clear
source: Clear date
ja: 日付を消去
zh_hans: 清除日期
zh_hant: 清除日期

# product.scan.review.date_picker.footer
source: Changing the date keeps an existing selected Event when possible. Clearing the date does not remove the original image.
ja: 日付を変更しても、選択済みのイベントが存在する場合は保持されます。日付を消去しても元画像は削除されません。
zh_hans: 日期变化会保留仍存在的已选活动；清除日期不会移除原图。
zh_hant: 變更日期時，仍存在的已選活動會保留；清除日期不會移除原圖。

# product.scan.review.date_picker.title
source: Select Date
ja: 日付を選択
zh_hans: 选择日期
zh_hant: 選擇日期

# product.scan.review.date_picker.update_failed
source: Unable to update date
ja: 日付を更新できません
zh_hans: 无法更新日期
zh_hant: 無法更新日期

# product.scan.review.date_picker.use_date
source: Use selected date
ja: 選択した日付を使用
zh_hans: 使用所选日期
zh_hant: 使用所選日期

# product.scan.review.delete_capture
source: Delete captured photo
ja: 撮影した写真を削除
zh_hans: 删除拍摄的照片
zh_hant: 刪除拍攝的照片

# product.scan.review.delete_capture_hint
source: Deletes the latest remaining camera source and all Cheki extracted from it
ja: 最新のカメラ写真と、そこから切り出したすべてのチェキを削除します
zh_hans: 删除最后一张相机原图及从中提取的所有拍立得
zh_hant: 刪除最後一張相機原圖及從中擷取的所有拍立得

# product.scan.review.delete_failed
source: Unable to delete this temporary Cheki.
ja: この一時チェキを削除できません。
zh_hans: 无法删除这张临时拍立得。
zh_hant: 無法刪除這張暫存拍立得。

# product.scan.review.discard
source: Discard review
ja: 確認内容を破棄
zh_hans: 放弃检查
zh_hant: 捨棄檢查

# product.scan.review.discard_action
source: Discard
ja: 破棄
zh_hans: 放弃
zh_hant: 捨棄

# product.scan.review.discard_message
source: This discards the unsaved review results and returns to Scan. Inputs that produced no Cheki are kept so you can retry them.
ja: 未保存のレビュー結果を破棄してスキャン画面に戻ります。チェキが0枚だった入力は再試行できるよう保持されます。
zh_hans: 这会放弃未保存的检查结果并返回扫描页面。未生成 拍立得 的输入会保留，以便重试。
zh_hant: 這會捨棄未儲存的檢查結果並返回掃描頁面。未產生 拍立得 的輸入會保留，以便重試。

# product.scan.review.discard_title
source: Discard unsaved results?
ja: 未保存の結果を破棄しますか？
zh_hans: 要放弃未保存的结果吗？
zh_hant: 要捨棄未儲存的結果嗎？

# product.scan.review.download
source: Save to Photos
ja: 写真に保存
zh_hans: 保存到相册
zh_hant: 儲存到相簿

# product.scan.review.edit
source: Edit temporary Cheki
ja: 一時チェキを編集
zh_hans: 编辑临时拍立得
zh_hant: 編輯暫存拍立得

# product.scan.review.editor.create_new
source: Create new Cheki
ja: 新しいチェキを作成
zh_hans: 新建拍立得
zh_hant: 新增拍立得

# product.scan.review.editor.current_index
source: Current index: %@
ja: 現在の番号：%@
zh_hans: 当前编号：%@
zh_hant: 目前編號：%@

# product.scan.review.editor.delete
source: Delete temporary Cheki
ja: 一時チェキを削除
zh_hans: 删除临时拍立得
zh_hant: 刪除暫存拍立得

# product.scan.review.editor.destination
source: Destination
ja: 保存先
zh_hans: 保存目标
zh_hant: 儲存目標

# product.scan.review.editor.existing_destination
source: Existing ×%1$lld · %2$@
ja: 既存 ×%1$lld・%2$@
zh_hans: 现有 ×%1$lld · %2$@
zh_hant: 現有 ×%1$lld · %2$@

# product.scan.review.editor.index_optional
source: Index (optional)
ja: 番号（任意）
zh_hans: 编号（可选）
zh_hant: 編號（選填）

# product.scan.review.editor.save_destination
source: Save destination
ja: 保存先
zh_hans: 保存目标
zh_hant: 儲存目標

# product.scan.review.editor.set_date
source: Set date
ja: 日付を設定
zh_hans: 设置日期
zh_hant: 設定日期

# product.scan.review.editor.title
source: Edit temporary Cheki
ja: 一時チェキを編集
zh_hans: 编辑临时拍立得
zh_hant: 編輯暫存拍立得

# product.scan.review.empty
source: No temporary Cheki
ja: 一時チェキはありません
zh_hans: 没有临时拍立得
zh_hant: 沒有暫存拍立得

# product.scan.review.empty_message
source: All temporary results were removed; nothing was saved.
ja: 一時結果はすべて削除され、何も保存されませんでした。
zh_hans: 所有临时结果已删除；没有内容写入存储。
zh_hant: 所有暫存結果已刪除；未儲存任何內容。

# product.scan.review.no_event
source: No Event
ja: イベントなし
zh_hans: 无活动
zh_hant: 無活動

# product.scan.review.prepare_save_failed
source: Unable to prepare the temporary Cheki for saving.
ja: 一時チェキの保存準備ができませんでした。
zh_hans: 无法准备保存临时拍立得。
zh_hant: 無法完成暫存拍立得的儲存準備。

# product.scan.review.preparing_annotation
source: Preparing detection box
ja: 検出枠を準備中
zh_hans: 正在生成标注框
zh_hant: 正在產生標註框

# product.scan.review.preparing_images
source: Preparing images
ja: 画像を準備中
zh_hans: 正在准备图片
zh_hant: 正在準備圖片

# product.scan.review.refit
source: Refit
ja: 再補正
zh_hans: 重新校正
zh_hant: 重新校正

# product.scan.review.refit_failed
source: Unable to refit this Cheki. The image was kept.
ja: チェキを再フィットできませんでした。元の画像は変更されていません。
zh_hans: 无法重新拟合这张 Cheki，已保留原图。
zh_hant: 無法重新擬合這張 Cheki，已保留原圖。

# product.scan.review.refit_failed_restore
source: Refit failed. Undo to restore the original image before saving.
ja: 再フィットに失敗しました。「元に戻す」で元の画像を表示してから保存してください。
zh_hans: 重新拟合失败。请先撤销以恢复原图，再保存。
zh_hant: 重新擬合失敗。請先復原原圖，再儲存。

# product.scan.review.save_all
source: Save all Cheki
ja: すべてのチェキを保存
zh_hans: 保存所有拍立得
zh_hant: 儲存所有拍立得

# product.scan.review.save_all_to_photos
source: Save all to Photos
ja: すべて写真に保存
zh_hans: 全部保存到相册
zh_hant: 全部儲存到相簿

# product.scan.review.save_all_to_photos_failed
source: The Review images could not be saved to Photos.
ja: レビュー画像を写真に保存できませんでした。
zh_hans: 无法将当前预览图片保存到相册。
zh_hant: 無法將目前預覽圖片儲存到相簿。

# product.scan.review.stage.finalizing
source: Finalizing
ja: 仕上げ中
zh_hans: 正在完成
zh_hant: 正在完成

# product.scan.review.stage.preparing_images
source: Preparing images
ja: 画像を準備中
zh_hans: 正在准备图片
zh_hant: 正在準備圖片

# product.scan.review.stage.saving_records
source: Saving records
ja: 記録を保存中
zh_hans: 正在保存记录
zh_hant: 正在儲存記錄

# product.scan.review.stale_refreshed
source: Some temporary Cheki became unavailable. The list was refreshed; review it and try again.
ja: 一部の一時チェキが利用できなくなりました。一覧を更新したので、確認して再試行してください。
zh_hans: 部分临时拍立得已失效；列表已刷新，请检查后重试。
zh_hant: 部分暫存拍立得已失效；清單已重新整理，請檢查後重試。

# product.scan.review.state_changed
source: Some temporary Cheki changed state. Unsaved items can still be retried.
ja: 一部の一時チェキの状態が変わりました。未保存の項目は再試行できます。
zh_hans: 部分临时拍立得状态发生变化；未保存项目仍可重试。
zh_hant: 部分暫存拍立得的狀態已變更；未儲存項目仍可重試。

# product.scan.review.temporary_date_update_unavailable
source: This temporary Cheki is no longer editable or is awaiting confirmation. The current date was kept.
ja: この一時チェキは編集できないか確認待ちです。現在の日付は保持されました。
zh_hans: 这张临时拍立得已失效或进入待确认状态；当前日期仍保留。
zh_hant: 這張暫存拍立得已失效或進入待確認狀態；目前日期仍保留。

# product.scan.review.temporary_idol_update_unavailable
source: This temporary Cheki is no longer editable or is awaiting confirmation. Your current selection was kept.
ja: この一時チェキは編集できないか確認待ちです。現在の選択は保持されました。
zh_hans: 这张临时拍立得已失效或进入待确认状态；当前选择仍保留。
zh_hant: 這張暫存拍立得已失效或進入待確認狀態；目前選擇仍保留。

# product.scan.review.temporary_size_update_unavailable
source: This temporary Cheki is no longer editable.
ja: この一時チェキは編集できなくなりました。
zh_hans: 这张临时拍立得已无法编辑。
zh_hant: 這張暫存拍立得已無法編輯。

# product.scan.review.title
source: Review %lld Cheki
ja: チェキ%lld枚を確認
zh_hans: 检查%lld张切
zh_hant: 檢查%lld張切

# product.scan.review.undo_refit
source: Undo
ja: 元に戻す
zh_hans: 撤销
zh_hant: 復原

# product.scan.review.view_annotation
source: View detection box
ja: 検出枠を表示
zh_hans: 查看标注框
zh_hant: 查看標註框

# product.scan.review.view_clean
source: View clean image
ja: 元画像を表示
zh_hans: 查看原图
zh_hant: 查看原圖

# product.scan.review.wait_for_actions
source: Wait for rotation or download to finish before saving.
ja: 回転またはダウンロードが完了してから保存してください。
zh_hans: 请等待旋转或下载完成后再保存。
zh_hant: 請等待旋轉或下載完成後再儲存。

# product.scan.review.warning_count
source: Valid results were kept; %lld items were incomplete. Check automatic recognition fields.
ja: 正常な結果は保持されました。%lld件が未完了です。自動認識の項目を確認してください。
zh_hans: 已保留正常结果；有%lld项未完成，请检查自动识别属性。
zh_hant: 已保留正常結果；有%lld項未完成，請檢查自動識別欄位。

# product.scan.rotate
source: Rotate
ja: 回転
zh_hans: 旋转
zh_hant: 旋轉

# product.scan.rotate_counterclockwise
source: Rotate counterclockwise
ja: 反時計回りに回転
zh_hans: 逆时针旋转
zh_hant: 逆時針旋轉

# product.scan.rotate_failed
source: Couldn't rotate this Cheki. The original is unchanged.
ja: このチェキを回転できませんでした。元の画像は変更されていません。
zh_hans: 无法旋转这张拍立得，原图保持不变。
zh_hant: 無法旋轉這張拍立得，原圖保持不變。

# product.scan.rotate_state
source: Counterclockwise turn %lld of 4
ja: 反時計回り%lld/4
zh_hans: 逆时针旋转%lld/4
zh_hant: 逆時針旋轉 %lld/4

# product.scan.rotating
source: Rotating…
ja: 回転中…
zh_hans: 正在旋转…
zh_hant: 正在旋轉…

# product.scan.select_photos
source: Select photos to scan.
ja: スキャンする写真を選択してください。
zh_hans: 请选择要扫描的照片。
zh_hant: 請選擇要掃描的照片。

# product.scan.selected_idol_avatar_count
source: Selected Idol avatar count
ja: 選択したアイドルのアバター数
zh_hans: 已选偶像头像数量
zh_hant: 已選偶像頭像數量

# product.scan.shot_type
source: Shot type
ja: 撮影タイプ
zh_hans: 合影类型
zh_hant: 合照類型

# product.scan.shot_type.toggle_hint
source: Double-tap to switch between solo and 2-shot.
ja: ダブルタップでソロと2ショットを切り替えます。
zh_hans: 轻点两下可在单人和双人之间切换。
zh_hant: 點兩下即可在單人與雙人之間切換。

# product.scan.shot_type.unknown
source: Unknown
ja: 不明
zh_hans: 未知
zh_hant: 未知

# product.scan.skip_recognition
source: Skip remaining recognition
ja: 残りの処理をスキップ
zh_hans: 跳过后续项目
zh_hant: 跳過後續項目

# product.scan.sleeves
source: Sleeves
ja: スリーブ
zh_hans: 卡套
zh_hant: 卡套

# product.scan.specified_confirm.continue
source: Continue
ja: 続ける
zh_hans: 继续
zh_hant: 繼續

# product.scan.specified_confirm.multiple
source: Multiple Idols are selected. Continue scanning and associate all currently selected Idols?
ja: 複数の推しが選択されています。現在選択中の全員に関連付けてスキャンを続けますか？
zh_hans: 已选择多个偶像。继续扫描并关联当前选中的全部偶像吗？
zh_hant: 已選擇多個偶像。要繼續掃描並關聯目前選取的全部偶像嗎？

# product.scan.specified_confirm.none
source: No Idol is selected. Continue scanning without associating any Idol?
ja: 推しが選択されていません。誰にも関連付けずにスキャンを続けますか？
zh_hans: 尚未选择偶像。继续扫描且不关联任何偶像吗？
zh_hant: 尚未選擇偶像。要繼續掃描且不關聯任何偶像嗎？

# product.scan.specified_confirm.title
source: Confirm Idol association
ja: 推しの関連付けを確認
zh_hans: 确认偶像关联
zh_hant: 確認偶像關聯

# product.scan.specified_date
source: Specified date
ja: 日付を指定
zh_hans: 指定日期
zh_hant: 指定日期

# product.scan.specified_idol
source: Specified Idol
ja: アイドルを指定
zh_hans: 指定偶像
zh_hant: 指定偶像

# product.scan.specified_idol_required
source: Select an Idol before starting Scan.
ja: スキャンを開始する前にアイドルを選択してください。
zh_hans: 开始扫描前请选择偶像。
zh_hant: 開始掃描前請選擇偶像。

# product.scan.start
source: Start scan
ja: スキャンを開始
zh_hans: 开始扫描
zh_hant: 開始掃描

# product.scan.start_hint
source: Processes the selected photos and shows editable temporary Cheki.
ja: 選択した写真を処理し、編集可能な一時チェキを表示します。
zh_hans: 处理已选照片并显示可编辑的临时拍立得。
zh_hant: 處理已選照片，並顯示可編輯的暫存拍立得。

# product.scan.temporary_unavailable
source: This temporary Cheki is no longer available.
ja: この一時チェキは利用できなくなりました。
zh_hans: 这张临时拍立得已不可用。
zh_hant: 這張暫存拍立得已無法使用。

# product.scan.unavailable
source: Scan unavailable
ja: スキャンを利用できません
zh_hans: 无法使用扫描
zh_hant: 無法使用掃描

# product.scan.update_idol_failed
source: Unable to update Idol
ja: アイドルを更新できません
zh_hans: 无法更新偶像
zh_hant: 無法更新偶像

# product.settings.account.footer
source: This screen does not provide an account, cloud sync, or social posting.
ja: この画面ではアカウント、クラウド同期、SNS投稿は提供されません。
zh_hans: 此页面不提供账号、云同步或社交发布功能。
zh_hant: 此頁面不提供帳號、雲端同步或社群發文功能。

# product.settings.algorithm.cheki_scan
source: Cheki scanning
ja: チェキスキャン
zh_hans: 拍立得扫描
zh_hant: 拍立得掃描

# product.settings.algorithm.cheki_scan.notice.message
source: The current algorithm still lacks precision around edges and may get complex cases such as overlaps or incomplete images wrong. It'll do for now, though. Maybe one day the author will be in a good mood and upgrade it again.
ja: 現在のアルゴリズムはまだ輪郭の精度が十分ではなく、重なりや一部が欠けたものなど、複雑なケースではうまく処理できないことがあります。とりあえずこれでしのげますが、作者の気が向けば、いつかまたアップデートするかもしれません。
zh_hans: 当前算法的边缘精度尚有欠缺，处理重叠或不完整等复杂情形可能出错，但可以先凑合着用，也许哪天作者心情好还会再次升级
zh_hant: 目前演算法的邊緣精準度還不夠，處理重疊或不完整等複雜情況時可能會出錯，不過可以先將就著用，說不定哪天作者心情好，還會再升級一次。

# product.settings.algorithm.cheki_scan.notice.title
source: Algorithm notice
ja: アルゴリズムについて
zh_hans: 算法说明
zh_hant: 演算法說明

# product.settings.algorithm.idol_recognition
source: Idol recognition
ja: アイドル認識
zh_hans: 偶像识别
zh_hant: 偶像識別

# product.settings.algorithms
source: Algorithms
ja: アルゴリズム
zh_hans: 算法
zh_hant: 演算法

# product.settings.app
source: App
ja: アプリ
zh_hans: 应用

# product.settings.cheki_sizes
source: Cheki sizes
ja: チェキサイズ
zh_hans: 拍立得尺寸
zh_hant: 拍立得尺寸

# product.settings.cheki_sizes.add
source: Add new size
ja: 新しいサイズを追加
zh_hans: 添加新的尺寸
zh_hant: 新增尺寸

# product.settings.cheki_sizes.details
source: Size details
ja: サイズの詳細
zh_hans: 尺寸详情
zh_hant: 尺寸詳情

# product.settings.cheki_sizes.height
source: Height
ja: 高さ
zh_hans: 高
zh_hant: 高

# product.settings.cheki_sizes.name
source: Name
ja: 名前
zh_hans: 名称
zh_hant: 名稱

# product.settings.cheki_sizes.preview
source: Preview
ja: プレビュー
zh_hans: 预览
zh_hant: 預覽

# product.settings.cheki_sizes.preview_hint
source: Enter two positive numbers to preview the size.
ja: 2つの正数を入力するとサイズをプレビューできます。
zh_hans: 输入两个正数以预览尺寸。
zh_hant: 輸入兩個正數以預覽尺寸。

# product.settings.cheki_sizes.rule
source: The shorter edge is fixed at 1200 px, and the longest edge may not exceed 8192 px.
ja: 短辺は1200px固定、長辺は8192px以下です。
zh_hans: 短边固定为1200px，最长边不能超过8192px。
zh_hant: 短邊固定為1200px，最長邊不能超過8192px。

# product.settings.cheki_sizes.too_large
source: The longest edge may not exceed 8192 px.
ja: 長辺は8192px以下にしてください。
zh_hans: 最长边不能超过8192px。
zh_hant: 最長邊不能超過8192px。

# product.settings.cheki_sizes.width
source: Width
ja: 幅
zh_hans: 宽
zh_hant: 寬

# product.settings.clear_all
source: Clear all data
ja: すべてのデータを消去
zh_hans: 清除全部数据
zh_hant: 清除全部資料

# product.settings.clear_confirm.message
source: This permanently removes every local record and app-managed media file. It does not affect Photos or remote services.
ja: すべてのローカル記録とアプリ管理メディアを完全に削除します。写真アプリやリモートサービスには影響しません。
zh_hans: 这会永久删除全部本地记录和应用托管媒体，不影响系统照片或远程服务。
zh_hant: 這會永久刪除全部本機記錄和 App 管理的媒體檔案，不會影響系統照片或遠端服務。

# product.settings.clear_confirm.title
source: Clear all local data?
ja: すべてのローカルデータを消去しますか？
zh_hans: 清除全部本地数据？
zh_hant: 要清除全部本機資料嗎？

# product.settings.clear_error.database
source: No data was cleared because the local database could not be saved: %@
ja: ローカルデータベースを保存できなかったため、データは消去されませんでした：%@
zh_hans: 本地数据库无法保存，未清除任何数据：%@
zh_hant: 無法儲存本機資料庫，未清除任何資料：%@

# product.settings.clear_error.files
source: All local records were cleared, but %1$lld managed media cleanup action(s) remain. Removed %2$lld file(s). They will be retried safely. %3$@
ja: ローカル記録は消去されましたが、管理対象メディアのクリーンアップが%1$lld件残っています。%2$lld件を削除しました。安全に再試行します。%3$@
zh_hans: 本地记录已清除，但仍有%1$lld项托管媒体清理待完成；已移除%2$lld个文件，之后会安全重试。%3$@
zh_hant: 本機記錄已清除，但仍有 %1$lld 項 App 管理的媒體清理作業待完成。已移除 %2$lld 個檔案，之後會安全地重試。%3$@

# product.settings.clear_error.indeterminate
source: No managed files were removed because the database commit could not be confirmed. Recovery will retry safely: %@
ja: データベースのコミットを確認できないため、管理対象ファイルは削除されませんでした。復旧時に安全に再試行します：%@
zh_hans: 无法确认数据库是否已提交，因此未移除托管文件；恢复时会安全重试：%@
zh_hant: 無法確認資料庫是否已提交，因此未移除 App 管理的檔案。復原時會安全地重試：%@

# product.settings.clear_error.not_committed
source: No data was cleared because safe cleanup could not be prepared: %@
ja: 安全なクリーンアップを準備できなかったため、データは消去されませんでした：%@
zh_hans: 无法准备安全清理，因此未清除任何数据：%@
zh_hant: 無法準備安全清理作業，因此未清除任何資料：%@

# product.settings.clear_result
source: Cleared %1$lld Cheki, %2$lld phone photos, %3$lld videos, %4$lld Events, %5$lld Idols, and %6$lld managed media files.
ja: チェキ%1$lld枚、写メ%2$lld枚、動画%3$lld本、イベント%4$lld件、アイドル%5$lld人、管理対象メディア%6$lld件を消去しました。
zh_hans: 已清除%1$lld张切、%2$lld张手机合影、%3$lld个视频、%4$lld个活动、%5$lld个偶像和%6$lld个托管媒体文件。
zh_hant: 已清除 %1$lld 張切、%2$lld 張手機合照、%3$lld 部影片、%4$lld 個活動、%5$lld 位偶像和 %6$lld 個 App 管理的媒體檔案。

# product.settings.clear_scope
source: Deletes this app's local records and managed media. Photos, settings, and remote data are not changed.
ja: このアプリのローカル記録と管理対象メディアのみを削除します。写真、設定、リモートデータは変更しません。
zh_hans: 仅删除本应用的本地记录和托管媒体，不更改系统照片、设置或远程数据。
zh_hant: 僅刪除此 App 的本機記錄和 App 管理的媒體，不會更改系統照片、設定或遠端資料。

# product.settings.clearing
source: Clearing all data…
ja: すべてのデータを消去中…
zh_hans: 正在清除全部数据…
zh_hant: 正在清除全部資料…

# product.settings.data
source: Data management
ja: データ管理
zh_hans: 数据管理
zh_hant: 資料管理

# product.settings.endpoint.invalid
source: Invalid endpoint configuration
ja: エンドポイント設定が無効です
zh_hans: 端点配置无效
zh_hant: 端點設定無效

# product.settings.endpoint.local
source: Local Scanner Debug
ja: ローカルスキャナーデバッグ
zh_hans: 本地扫描器调试
zh_hant: 本機掃描器除錯

# product.settings.endpoint.production
source: Production proxy
ja: 本番プロキシ
zh_hans: 生产代理
zh_hant: 正式環境代理

# product.settings.export
source: Export data
ja: データを書き出す
zh_hans: 导出数据
zh_hant: 匯出資料

# product.settings.export.error.archive
source: The backup archive could not be created.
ja: バックアップファイルを作成できませんでした。
zh_hans: 无法创建备份文件。
zh_hant: 無法建立備份檔案。

# product.settings.export.error.missing_media
source: A referenced media file is missing or unreadable: %@
ja: 参照されているメディアファイルが見つからないか、読み込めません：%@
zh_hans: 引用的媒体文件缺失或无法读取：%@
zh_hant: 引用的媒體檔案遺失或無法讀取：%@

# product.settings.export.error.space
source: Not enough storage to finish this backup. Free up space and try again.
ja: バックアップを完了するための空き容量が不足しています。空き容量を確保して、もう一度お試しください。
zh_hans: 存储空间不足，无法完成备份。请释放空间后重试。
zh_hant: 儲存空間不足，無法完成備份。請釋放空間後再試。

# product.settings.export.error.space_details
source: Not enough storage for this backup. About %@ is needed, including working space; %@ is available. Free up space and try again.
ja: バックアップ用の空き容量が不足しています。作業領域を含めて約%@が必要ですが、空き容量は%@です。空き容量を確保して、もう一度お試しください。
zh_hans: 备份所需空间不足。包括临时工作空间在内，预计需要约%@，当前可用%@。请释放空间后重试。
zh_hant: 備份所需空間不足。包括暫存工作空間在內，預計需要約%@，目前可用%@。請釋放空間後再試。

# product.settings.export.error.title
source: Export failed
ja: 書き出しに失敗しました
zh_hans: 导出失败
zh_hant: 匯出失敗

# product.settings.export.error.write_rejected
source: The system rejected a storage write while creating the backup. The backup was not completed.
ja: バックアップ作成中に、システムがストレージへの書き込みを拒否しました。バックアップは完了していません。
zh_hans: 创建备份时，系统拒绝了存储写入。备份未完成。
zh_hant: 建立備份時，系統拒絕了儲存寫入。備份未完成。

# product.settings.export.error.write_rejected_details
source: The system rejected a storage write while creating the backup. %@ had been written; immediately available space at the failure was %@. The backup was not completed.
ja: バックアップ作成中に、システムがストレージへの書き込みを拒否しました。書き込み済みは%@、失敗時に直ちに利用可能だった容量は%@です。バックアップは完了していません。
zh_hans: 创建备份时，系统拒绝了存储写入。当时已写入%@，失败时可立即使用的空间为%@。备份未完成。
zh_hant: 建立備份時，系統拒絕了儲存寫入。當時已寫入%@，失敗時可立即使用的空間為%@。備份未完成。

# product.settings.export.preparing
source: Preparing export…
ja: 書き出しを準備中…
zh_hans: 正在准备导出…
zh_hant: 正在準備匯出…

# product.settings.hidden_idols
source: Hidden Idols
ja: 非表示のアイドル
zh_hans: 已隐藏的偶像
zh_hant: 已隱藏的偶像

# product.settings.hidden_idols.empty
source: No hidden Idols
ja: 非表示のアイドルはいません
zh_hans: 没有已隐藏的偶像
zh_hant: 沒有已隱藏的偶像

# product.settings.import
source: Import data
ja: データを読み込む
zh_hans: 导入数据
zh_hant: 匯入資料

# product.settings.import.action
source: Import and replace
ja: 読み込んで置き換える
zh_hans: 导入并覆盖
zh_hant: 匯入並覆蓋

# product.settings.import.confirm.message
source: Continuing will validate the selected backup and, if validation succeeds, automatically replace every local record, setting, and app-managed media file. Cancel to keep the current library.
ja: 続行すると選択したバックアップを検証し、検証に成功すると、すべてのローカル記録、設定、アプリ管理メディアを自動的に置き換えます。現在のライブラリを保持するにはキャンセルしてください。
zh_hans: 继续后将验证所选备份，验证通过即自动替换全部本地记录、设置和由 App 管理的媒体文件。如需保留当前资料库，请取消。
zh_hant: 繼續後將驗證所選備份，驗證通過即自動替換全部本機記錄、設定和由 App 管理的媒體檔案。如需保留目前的資料庫，請取消。

# product.settings.import.confirm.title
source: Import will replace all local data
ja: 読み込むとローカルデータがすべて上書きされます
zh_hans: 导入将覆盖现有全部本地数据
zh_hant: 匯入將覆蓋現有全部本機資料

# product.settings.import.continue
source: Continue
ja: 続ける
zh_hans: 继续
zh_hant: 繼續

# product.settings.import.error.archive
source: The selected file is not a valid Chekinana backup.
ja: 選択したファイルは有効な Chekinana バックアップではありません。
zh_hans: 所选文件不是有效的 Chekinana 备份。
zh_hant: 所選檔案不是有效的 Chekinana 備份。
